Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default/default.tfplan"' in '/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default': exit status 1
module.authentik_system.random_password.akadmin_api_key: Refreshing state... [id=none]
module.authentik_system.random_password.authentik_secret_key: Refreshing state... [id=none]
kubernetes_service_account_v1.bill: Refreshing state... [id=default/bill]
module.dashboard.kubernetes_namespace_v1.kube_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.atlantis.kubernetes_cluster_role_v1.atlantis-admin: Refreshing state... [id=atlantis-admin]
module.atlantis.kubernetes_cluster_role_binding_v1.atlantis-admin: Refreshing state... [id=admin]
module.authentik_system.random_password.postgresql_password: Refreshing state... [id=none]
kubernetes_service_account_v1.test: Refreshing state... [id=default/test]
module.omada_controller.kubernetes_namespace_v1.omada_controller: Refreshing state... [id=omada-controller]
module.longhorn_system.kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
module.pihole_system.data.kubernetes_service_v1.traefik: Reading...
module.authentik_system.random_password.akadmin_password: Refreshing state... [id=none]
kubernetes_secret_v1.bill_token: Refreshing state... [id=default/bill-token]
module.atlantis.kubernetes_namespace_v1.namespace: Refreshing state... [id=atlantis-system]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Reading...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Reading...
module.authentik_system.data.aws_ssm_parameter.smtp: Reading...
module.atlantis.aws_iam_user.atlantis: Refreshing state... [id=atlantis]
module.longhorn_system.aws_iam_user.longhorn: Refreshing state... [id=longhorn]
module.longhorn_system.aws_s3_bucket.longhorn_backups: Refreshing state... [id=longhorn-backups.billv.ca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:
╷
│ Error: clusterroles.rbac.authorization.k8s.io "atlantis-admin" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "clusterroles" in API group "rbac.authorization.k8s.io" at the cluster scope
│ 
│ 
╵
╷
│ Error: clusterrolebindings.rbac.authorization.k8s.io "admin" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "clusterrolebindings" in API group "rbac.authorization.k8s.io" at the cluster scope
│ 
│ 
╵

  # module.longhorn_system.aws_s3_bucket.longhorn_backups will be created
  + resource "aws_s3_bucket" "longhorn_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "longhorn-backups.billv.ca"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: serviceaccounts "bill" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "serviceaccounts" in API group "" in the namespace "default"
│ 
│   with kubernetes_service_account_v1.bill,
│   on main.tf line 60, in resource "kubernetes_service_account_v1" "bill":
│   60: resource "kubernetes_service_account_v1" "bill" {
│ 
╵
╷
│ Error: serviceaccounts "test" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "serviceaccounts" in API group "" in the namespace "default"
│ 
│   with kubernetes_service_account_v1.test,
│   on main.tf line 66, in resource "kubernetes_service_account_v1" "test":
│   66: resource "kubernetes_service_account_v1" "test" {
│ 
╵
╷
│ Error: secrets "bill-token" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "secrets" in API group "" in the namespace "default"
│ 
│   with kubernetes_secret_v1.bill_token,
│   on main.tf line 87, in resource "kubernetes_secret_v1" "bill_token":
│   87: resource "kubernetes_secret_v1" "bill_token" {
│ 
╵
╷
│ Error: namespaces "atlantis-system" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "namespaces" in API group "" in the namespace "atlantis-system"
│ 
│   with module.atlantis.kubernetes_namespace_v1.namespace,
│   on modules/atlantis-system/main.tf line 15, in resource "kubernetes_namespace_v1" "namespace":
│   15: resource "kubernetes_namespace_v1" "namespace" {
│ 
╵
╷
│ Error: reading SSM Parameter (/runatlantis/key): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 31a331a3-e082-4b66-8e09-d0b80ade6b01, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/key because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.atlantis.data.aws_ssm_parameter.atlantis-key,
│   on modules/atlantis-system/main.tf line 21, in data "aws_ssm_parameter" "atlantis-key":
│   21: data "aws_ssm_parameter" "atlantis-key" {
│ 
╵
╷
│ Error: reading SSM Parameter (/runatlantis/webhook-secret): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 52d7f767-b0a3-4539-a76d-47317a74e11a, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/webhook-secret because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.atlantis.data.aws_ssm_parameter.atlantis-secret,
│   on modules/atlantis-system/main.tf line 25, in data "aws_ssm_parameter" "atlantis-secret":
│   25: data "aws_ssm_parameter" "atlantis-secret" {
│ 
╵
╷
│ Error: reading IAM User (atlantis): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: f6dca1d6-7d42-47d7-8c88-72f3aa16d43d, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user atlantis because no identity-based policy allows the iam:GetUser action
│ 
│   with module.atlantis.aws_iam_user.atlantis,
│   on modules/atlantis-system/main.tf line 29, in resource "aws_iam_user" "atlantis":
│   29: resource "aws_iam_user" "atlantis" {
│ 
╵
╷
│ Error: reading SSM Parameter (zoho-smtp-creds): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 2ac45239-5d11-4beb-b8a9-251425e083d3, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/zoho-smtp-creds because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.authentik_system.data.aws_ssm_parameter.smtp,
│   on modules/authentik-system/main.tf line 15, in data "aws_ssm_parameter" "smtp":
│   15: data "aws_ssm_parameter" "smtp" {
│ 
╵
╷
│ Error: Plugin error
│ 
│   with module.authentik_system.kubernetes_manifest.certificate_authentik_star_billv_ca,
│   on modules/authentik-system/main.tf line 102, in resource "kubernetes_manifest" "certificate_authentik_star_billv_ca":
│  102: resource "kubernetes_manifest" "certificate_authentik_star_billv_ca" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [cert-manager.io/v1, Kind=Certificate] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.authentik_system.kubernetes_manifest.certificate_authentik_auth_billv_ca,
│   on modules/authentik-system/main.tf line 125, in resource "kubernetes_manifest" "certificate_authentik_auth_billv_ca":
│  125: resource "kubernetes_manifest" "certificate_authentik_auth_billv_ca" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [cert-manager.io/v1, Kind=Certificate] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.authentik_system.kubernetes_manifest.ingressroute,
│   on modules/authentik-system/main.tf line 147, in resource "kubernetes_manifest" "ingressroute":
│  147: resource "kubernetes_manifest" "ingressroute" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [traefik.containo.us/v1alpha1, Kind=IngressRoute] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.cert-manager.kubernetes_manifest.namespace_cert_manager,
│   on modules/cert-manager/main.tf line 1, in resource "kubernetes_manifest" "namespace_cert_manager":
│    1: resource "kubernetes_manifest" "namespace_cert_manager" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK [/v1,
│ Kind=Namespace] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: namespaces "kubernetes-dashboard" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "namespaces" in API group "" in the namespace "kubernetes-dashboard"
│ 
│   with module.dashboard.kubernetes_namespace_v1.kube_dashboard,
│   on modules/dashboard-system/main.tf line 12, in resource "kubernetes_namespace_v1" "kube_dashboard":
│   12: resource "kubernetes_namespace_v1" "kube_dashboard" {
│ 
╵
╷
│ Error: namespaces "longhorn-system" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "namespaces" in API group "" in the namespace "longhorn-system"
│ 
│   with module.longhorn_system.kubernetes_namespace.longhorn_system,
│   on modules/longhorn-system/main.tf line 15, in resource "kubernetes_namespace" "longhorn_system":
│   15: resource "kubernetes_namespace" "longhorn_system" {
│ 
╵
╷
│ Error: reading IAM User (longhorn): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: c999a588-09ae-493d-b29c-2373ea0e7d90, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user longhorn because no identity-based policy allows the iam:GetUser action
│ 
│   with module.longhorn_system.aws_iam_user.longhorn,
│   on modules/longhorn-system/main.tf line 25, in resource "aws_iam_user" "longhorn":
│   25: resource "aws_iam_user" "longhorn" {
│ 
╵
╷
│ Error: Plugin error
│ 
│   with module.longhorn_system.kubernetes_manifest.recurringjob_longhorn_system_daily_backup,
│   on modules/longhorn-system/main.tf line 142, in resource "kubernetes_manifest" "recurringjob_longhorn_system_daily_backup":
│  142: resource "kubernetes_manifest" "recurringjob_longhorn_system_daily_backup" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [longhorn.io/v1beta1, Kind=RecurringJob] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.metallb-system.kubernetes_manifest.namespace_metallb_system,
│   on modules/metallb-system/main.tf line 1, in resource "kubernetes_manifest" "namespace_metallb_system":
│    1: resource "kubernetes_manifest" "namespace_metallb_system" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK [/v1,
│ Kind=Namespace] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: namespaces "omada-controller" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "namespaces" in API group "" in the namespace "omada-controller"
│ 
│   with module.omada_controller.kubernetes_namespace_v1.omada_controller,
│   on modules/omada-controller/main.tf line 9, in resource "kubernetes_namespace_v1" "omada_controller":
│    9: resource "kubernetes_namespace_v1" "omada_controller" {
│ 
╵
╷
│ Error: services "traefik" is forbidden: User "system:serviceaccount:atlantis-system:runatlantis" cannot get resource "services" in API group "" in the namespace "kube-system"
│ 
│   with module.pihole_system.data.kubernetes_service_v1.traefik,
│   on modules/pihole-system/main.tf line 12, in data "kubernetes_service_v1" "traefik":
│   12: data "kubernetes_service_v1" "traefik" {
│ 
╵
╷
│ Error: Plugin error
│ 
│   with module.pihole_system.kubernetes_manifest.certificate_authentik_star_billv_ca,
│   on modules/pihole-system/main.tf line 77, in resource "kubernetes_manifest" "certificate_authentik_star_billv_ca":
│   77: resource "kubernetes_manifest" "certificate_authentik_star_billv_ca" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [cert-manager.io/v1, Kind=Certificate] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.pihole_system.kubernetes_manifest.middleware_admin,
│   on modules/pihole-system/main.tf line 98, in resource "kubernetes_manifest" "middleware_admin":
│   98: resource "kubernetes_manifest" "middleware_admin" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [traefik.containo.us/v1alpha1, Kind=Middleware] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.pihole_system.kubernetes_manifest.middleware_ipallowlist,
│   on modules/pihole-system/main.tf line 114, in resource "kubernetes_manifest" "middleware_ipallowlist":
│  114: resource "kubernetes_manifest" "middleware_ipallowlist" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [traefik.containo.us/v1alpha1, Kind=Middleware] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.pihole_system.kubernetes_manifest.ingressroute,
│   on modules/pihole-system/main.tf line 135, in resource "kubernetes_manifest" "ingressroute":
│  135: resource "kubernetes_manifest" "ingressroute" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [traefik.containo.us/v1alpha1, Kind=IngressRoute] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.pihole_system.kubernetes_manifest.certificate_piholeassistant_billv_ca,
│   on modules/pihole-system/main.tf line 168, in resource "kubernetes_manifest" "certificate_piholeassistant_billv_ca":
│  168: resource "kubernetes_manifest" "certificate_piholeassistant_billv_ca" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [cert-manager.io/v1, Kind=Certificate] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.pihole_system.kubernetes_manifest.assistant_ingressroute,
│   on modules/pihole-system/main.tf line 189, in resource "kubernetes_manifest" "assistant_ingressroute":
│  189: resource "kubernetes_manifest" "assistant_ingressroute" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [traefik.containo.us/v1alpha1, Kind=IngressRoute] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵
╷
│ Error: Plugin error
│ 
│   with module.traefik_config.kubernetes_manifest.traefik_entrypoints,
│   on modules/traefik-config/main.tf line 1, in resource "kubernetes_manifest" "traefik_entrypoints":
│    1: resource "kubernetes_manifest" "traefik_entrypoints" {
│ 
│ The plugin returned an unexpected error from
│ plugin.(*GRPCProvider).UpgradeResourceState: rpc error: code = Unknown desc
│ = failed to determine resource type ID: failed to look up GVK
│ [helm.cattle.io/v1, Kind=HelmChartConfig] among available CRDs:
│ customresourcedefinitions.apiextensions.k8s.io is forbidden: User
│ "system:serviceaccount:atlantis-system:runatlantis" cannot list resource
│ "customresourcedefinitions" in API group "apiextensions.k8s.io" at the
│ cluster scope
╵


```
</details>